In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
table = pd.read_csv("book1.csv")
table

    Country      State  Litracy rate  Saleries
0  Pakistan   peshawar            75     25000
1  Pakistan   islambad            85     30000
2  Pakistan    karachi            80     40000
3  Pakistan     lahore            82     35000
4  Pakistan     multan            30     20000
5  Pakistan     mardan            77     25000
6  Pakistan     sawabi            66     44000
7  Pakistan  charsadda            55     43000

In [9]:
table.describe()

       Litracy rate      Saleries
count      8.000000      8.000000
mean      68.750000  32750.000000
std       18.406133   9098.665522
min       30.000000  20000.000000
25%       63.250000  25000.000000
50%       76.000000  32500.000000
75%       80.500000  40750.000000
max       85.000000  44000.000000

In [26]:
table.groupby(['Country']).Saleries.count()

Country
Pakistan    8
Name: Saleries, dtype: int64

In [27]:
table.groupby(['Country']).Saleries.max()

Country
Pakistan    44000
Name: Saleries, dtype: int64

In [23]:
min=table.groupby(['Country'])
min.min()

           Country      State  Litracy rate
Saleries
20000     Pakistan     multan            30
25000     Pakistan     mardan            75
30000     Pakistan   islambad            85
35000     Pakistan     lahore            82
40000     Pakistan    karachi            80
43000     Pakistan  charsadda            55
44000     Pakistan     sawabi            66

In [28]:
table.groupby(['Country']).Saleries.mean()

Country
Pakistan    32750
Name: Saleries, dtype: int64